app/controllers/api/v1/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "blocks".* FROM "blocks" WHERE "blocks"."list_id" = $1 ORDER BY "blocks"."location" ASC  [["list_id", 1]]
---
  def show
    list = List.find(params[:id])
    blocks = list.blocks
    blocks = blocks.order(location: :asc)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "blocks".* FROM "blocks" WHERE "blocks"."list_id" = $1  [["list_id", 1]]
UPDATE "blocks" SET "location" = $1, "updated_at" = $2 WHERE "blocks"."id" = $3  [["location", 1], ["updated_at", "2017-08-26 17:20:58.656985"], ["id", 1]]
---
  def update
    resorted_blocks = JSON.parse(request.body.read)
    blocks = List.find(params[:id]).blocks
    blocks.each do |block|
      resorted_blocks["blocks"].each_with_index do |resorted_block, i|
        if resorted_block["id"] == block.id
          new_location = (i + 1)
          unless new_location == block.location
            block.location = new_location
            block.save